/**
 * Created by frank.zhou on 2017/07/10.
 */
(function(){
  "use strict";

  angular
    .module("myApp")
    .constant("FLOOR_COLOR", {
        A : "#DE291E", // R1061大红

        B : "#FFA12D", // Y0316神铬黄

        C : "#F4E800", // Y0318嫩黄

        D : "#2FB135", // Y0922翠绿

        E : "#4892DD", // B0208深海蓝

        F : "#6C207B", // B1352紫色

        G : "#F18CD2", // R1018洋红

        H : "#512C1A", // GY0569棕灰

        I : "#014631", // G1021墨绿

        J : "#9292CE", // GY0244灰蓝

        K : "#C3C7C8", // B0203淡蓝

        L : "#7ADDD8" // W1147雪青
      // A: "#E51214", // R1061大红
      // B: "#EF9112", // Y0316神铬黄
      // C: "#F5EB2D", // Y0318嫩黄
      // D: "#40AF36", // Y0922翠绿
      // E: "#1C86CA", // B0208深海蓝
      // F: "#302087", // B1352紫色
      // G: "#9F087C", // R1018洋红
      // H: "#894C2C", // GY0569棕灰
      // I: "#2E4E36", // G1021墨绿
      // J: "#CDE7D7", // GY0244灰蓝
      // K: "#B7D5EF", // B0203淡蓝
      // L: "#B98FBF" // W1147雪青
    });
})();